app/Controllers/Clientes.php

    public function index(): string
    {
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->findAll();
---
SELECT *
FROM `clientes`

    public function agregarCliente()
    {
        $datos=[
            'cliente_id'=>$this->request->getVar('txtIdCliente'),
            'nombre'=>$this->request->getVar('txtNombre'),
            'apellido'=>$this->request->getVar('txtApellido'),
            'nit'=>$this->request->getVar('txtNit'),
            'telefono'=>$this->request->getVar('txtTelefono'),
            'correo_electronico'=>$this->request->getVar('txtCorreo'),
            'direccion'=>$this->request->getVar('txtDireccion')

        ];
        $clientes = new ClientesModel();
        $clientes->insert($datos);
---
INSERT INTO `clientes` (`cliente_id`, `nombre`, `apellido`, `nit`, `telefono`, `correo_electronico`, `direccion`) VALUES ('5543', 'uljk', 'lñbj.', '543', '', '', '')

    public function buscarCliente($id=null)
    {
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->where('cliente_id',$id)->first();
---
SELECT *
FROM `clientes`
WHERE `cliente_id` = '1'
 LIMIT 1